app/controllers/body_measurements_controller.rb

  def index
    @body_measurements = BodyMeasurement.all
---
SELECT "body_measurements".* FROM "body_measurements"